In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
path = "data/"
file = "Data.xlsx"
sheet_pos = pd.read_excel(f"{path}{file}", sheet_name = "POS DATA")
sheet_loyal = pd.read_excel(f"{path}{file}", sheet_name = "LOYALTY")
sheet_barcodes = pd.read_excel(f"{path}{file}", sheet_name = "barcodes")
sheet_tax = pd.read_excel(f"{path}{file}", sheet_name = "product taxonomy")

sheet_pos.reset_index(inplace = True, drop = True)
sheet_loyal.reset_index(inplace = True, drop = True)
sheet_barcodes.reset_index(inplace = True, drop = True)
sheet_tax.reset_index(inplace = True, drop = True)

In [3]:
sheet_loyal.head()

    CardholderID   Age  Gender   MaritalStatus  HouseholdSize  Children
0  9162002273446  51.0    Male  Single (Alone)            1.0       0.0
1  9164011076155  72.0  Female             NaN            2.0       0.0
2  9162001049684  60.0  Female             NaN            1.0       0.0
3  9162005608405   NaN  Female         Married            5.0       NaN
4  9163002257856  50.0  Female             NaN            1.0       0.0

In [4]:
sheet_pos.head(10)

    Basket_ID   Date       Barcode  Sum_Units  Sum_Value       Card_ID
0  1103084867  41379  800220505783          2   1.960000  9.160004e+12
1  1103853519  41381  520139501183          1   5.349993  9.164002e+12
2  1092750793  41346  520423907421          6   1.740015  9.164013e+12
3  1106160983  41388  211069400000          1   0.749817  9.162006e+12
4  1108695491  41395  520286400380          2   0.600000  9.161004e+12
5  1089674734  41337  212878100000          1   3.808804  9.162007e+12
6  1100327962  41370       8716266          1   0.740015  9.164013e+12
7  1105798474  41387  211087700000          1   1.560235  9.162002e+12
8  1104570471  41383  520441601390          1   0.880000  9.163002e+12
9  1095466893  41355  520423930028          1   1.460015           NaN

In [5]:
sheet_pos['Card_ID'].value_counts()

9.164002e+12    448
9.162002e+12    428
9.163002e+12    396
9.162000e+12    352
9.163002e+12    333
               ...
9.164014e+12      1
9.162001e+12      1
9.164013e+12      1
9.164002e+12      1
9.163002e+12      1
Name: Card_ID, Length: 4399, dtype: int64

### Tips Information Quality

In [6]:
print("Size barcodes before faulty values removed: " + str(len(sheet_pos.index)))
sheet_pos = sheet_pos.loc[sheet_pos['Sum_Units'] >= 0]
print("Size barcodes after faulty values removed: " + str(len(sheet_pos.index)))

Size barcodes before faulty values removed: 235474
Size barcodes after faulty values removed: 234946

In [7]:
print("Size barcodes before faulty values removed: " + str(len(sheet_pos.index)))
sheet_pos = sheet_pos.loc[sheet_pos['Sum_Value'] >= 0]
print("Size barcodes after faulty values removed: " + str(len(sheet_pos.index)))

Size barcodes before faulty values removed: 234946
Size barcodes after faulty values removed: 234946

In [8]:
print("Average age with all values is: " + str(sheet_loyal['Age'].mean()))

Average age with all values is: 49.33173858179078

In [9]:
sheet_loyal.loc[sheet_loyal['Age'] > 100]

      CardholderID    Age  Gender MaritalStatus  HouseholdSize  Children
535  9163002277687  150.0  Female           NaN            2.0       1.0

In [10]:
sheet_loyal.loc[sheet_loyal['Age'] < 100]

         CardholderID   Age  Gender   MaritalStatus  HouseholdSize  Children
0       9162002273446  51.0    Male  Single (Alone)            1.0       0.0
1       9164011076155  72.0  Female             NaN            2.0       0.0
2       9162001049684  60.0  Female             NaN            1.0       0.0
4       9163002257856  50.0  Female             NaN            1.0       0.0
5       9163005551142  35.0  Female             NaN            2.0       1.0
...               ...   ...     ...             ...            ...       ...
191118  9164002118581  74.0  Female             NaN            2.0       0.0
191121  9164007988257  33.0  Female             NaN            1.0       0.0
191122  9163001180865  62.0    Male  Single (Alone)            1.0       0.0
191124  9160000248237  75.0    Male         Married            1.0       0.0
191125  9162008409016  49.0  Female         Married            4.0       2.0

[110152 rows x 6 columns]

In [11]:
sheet_loyal.loc[sheet_loyal['HouseholdSize'] > 10]

         CardholderID   Age  Gender    MaritalStatus  HouseholdSize  Children
2158    9162003717673  47.0  Female          Married           33.0       2.0
7774    9164011952558  32.0    Male              NaN           23.0       NaN
8510    9164011040491   NaN    Male              NaN           12.0       2.0
12536   9162003563898   NaN    Male              NaN           14.0       NaN
12901   9162000999973  92.0    Male          Married           11.0       2.0
...               ...   ...     ...              ...            ...       ...
188008  9164001651553  63.0  Female              NaN           12.0       NaN
188232  9162000534037  65.0  Female  Single (Family)           12.0       3.0
190436  9162001048229  55.0    Male          Married           33.0       2.0
190617  9163003795753  35.0  Female              NaN           30.0       2.0
190824  9160003253245  43.0  Female              NaN           13.0       NaN

[94 rows x 6 columns]

In [12]:
sheet_loyal.loc[sheet_loyal['Children'] > 8]

Empty DataFrame
Columns: [CardholderID, Age, Gender, MaritalStatus, HouseholdSize, Children]
Index: []

In [13]:
print("Size loyalty before faulty values removed: " + str(sheet_loyal.shape))
sheet_loyal = sheet_loyal.loc[sheet_loyal['HouseholdSize'] <= 10]
print("Size loyalty after faulty values removed: " + str(sheet_loyal.shape))

Size loyalty before faulty values removed: (191129, 6)
Size loyalty after faulty values removed: (171940, 6)

In [14]:
sheet_loyal.head()

    CardholderID   Age  Gender   MaritalStatus  HouseholdSize  Children
0  9162002273446  51.0    Male  Single (Alone)            1.0       0.0
1  9164011076155  72.0  Female             NaN            2.0       0.0
2  9162001049684  60.0  Female             NaN            1.0       0.0
3  9162005608405   NaN  Female         Married            5.0       NaN
4  9163002257856  50.0  Female             NaN            1.0       0.0

In [15]:
print("Size loyalty before faulty household values removed: " + str(sheet_loyal.shape))
sheet_loyal = sheet_loyal.loc[sheet_loyal['Age'] < 100]
print("Size loyalty after faulty household values removed: " + str(sheet_loyal.shape))

Size loyalty before faulty household values removed: (171940, 6)
Size loyalty after faulty household values removed: (109915, 6)

In [16]:
print("Average age with removed values is: " + str(sheet_loyal['Age'].mean()))

Average age with removed values is: 49.33346676977665

In [17]:
df1 = sheet_barcodes.copy()
df1['Barcode'] = df1['Barcode'].astype('str')
### barcodes must be length 12
mask = (df1['Barcode'].str.len() != 12)
rm = df1.loc[mask]
rm1 = list(rm['Barcode'])
print("Number of values to be removed: " + str(len(rm1)))
print("Size barcodes before faulty values removed: " + str(len(sheet_barcodes.index)))
sheet_barcodes = df1[~df1['Barcode'].isin(rm1)]
print("Size barcodes after faulty values removed: " + str(len(sheet_barcodes.index)))

Number of values to be removed: 283
Size barcodes before faulty values removed: 9322
Size barcodes after faulty values removed: 9039

### Check Nulls in Dataframes

In [18]:
def check_nulls(result):    
    features_with_na = [features for features in result.columns if result[features].isnull().sum() > 0]

    for feature in features_with_na: 
        print(feature, np.round(result[feature].isnull().mean(), 4) * 100, '% missing values')
        print(features_with_na)

In [19]:
check_nulls(sheet_pos)
### these are non card values
### split up into card and non card POS data?

Card_ID 36.76 % missing values
['Card_ID']

In [20]:
check_nulls(sheet_loyal)

MaritalStatus 67.27 % missing values
['MaritalStatus', 'Children']
Children 13.669999999999998 % missing values
['MaritalStatus', 'Children']

In [21]:
check_nulls(sheet_barcodes)
### no nulls

In [22]:
check_nulls(sheet_tax)
### no nulls

In [23]:
print("Loyalty data size is: " + str(sheet_loyal.size))
print("POS data size is: " + str(sheet_pos.size))

Loyalty data size is: 659490
POS data size is: 1409676

There is quite a significant number of null values here between all columns in the POS and Loyalty data, in particularly the loyalty data. Removing these can lead to lack of variance in data among others but some of these may not be useful for relevant information. The "CARD_ID" column in the POS data doesn't really provide any information and the corresponding values for rows with null values are invalid (negative values) so these null values can be removed. The Loyalty data is more complex however. Some columns have huge amounts of null values (Marital Status has over 80% nulls) and if we drop these values we could potentially lose valuable information. We could initially drop all these values but after some analysis and clustering we could decide to drop on a subset of columns and remove columns such as marital status with a high percentage of null values.

In [24]:
#sheet_loyal.dropna(inplace = True)

In [25]:
print("Loyalty data size after dropping nulls is: " + str(sheet_loyal.size))

Loyalty data size after dropping nulls is: 659490

In [26]:
sheet_pos_card = sheet_pos[sheet_pos[['Card_ID']].notnull().all(1)]
sheet_pos_card.head()

    Basket_ID   Date       Barcode  Sum_Units  Sum_Value       Card_ID
0  1103084867  41379  800220505783          2   1.960000  9.160004e+12
1  1103853519  41381  520139501183          1   5.349993  9.164002e+12
2  1092750793  41346  520423907421          6   1.740015  9.164013e+12
3  1106160983  41388  211069400000          1   0.749817  9.162006e+12
4  1108695491  41395  520286400380          2   0.600000  9.161004e+12

In [27]:
sheet_pos_not_card = sheet_pos[~sheet_pos[['Card_ID']].notnull().all(1)]
sheet_pos_not_card.drop(columns = ['Card_ID'], inplace = True)
sheet_pos_not_card.head()

C:\Users\user\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

     Basket_ID   Date       Barcode  Sum_Units  Sum_Value
9   1095466893  41355  520423930028          1   1.460015
13  1093956996  41349  213227800000          1   1.991343
14  1099544322  41368  520423932241          1   0.850007
16  1101537793  41374  520423929487          1   1.690007
18  1090426738  41339  520100507417          1   1.500015

In [28]:
with pd.ExcelWriter('data/cleaned-data.xlsx') as writer:  
    sheet_pos_card.to_excel(writer, sheet_name = 'POS Card Data', index = False)
    sheet_pos_not_card.to_excel(writer, sheet_name = 'POS Non Card Data', index = False)
    sheet_loyal.to_excel(writer, sheet_name = 'Loyalty', index = False)
    sheet_barcodes.to_excel(writer, sheet_name = 'Barcodes', index = False)
    sheet_tax.to_excel(writer, sheet_name = 'Product Taxonomy', index = False)